# Core tools
brew "neovim"
brew "stow"
brew "ripgrep"
brew "jq"
brew "htop"
brew "wget"

# Shell
brew "starship"
brew "zoxide"

# Version management
brew "mise"

# Development
brew "go"
brew "gh"
brew "cmake"
brew "ninja"
brew "python@3.11"
brew "yarn"

# Utilities
brew "dos2unix"
brew "gnupg"
brew "topgrade"

# Apps
cask "alfred"
cask "caffeine"
cask "firefox"
cask "ghostty"
cask "karabiner-elements"
