brew "cmake"
brew "dos2unix"
brew "gh"
brew "gnutls"
brew "libassuan"
brew "libksba"
brew "pinentry"
brew "gnupg"
brew "go"
brew "htop"
brew "jq"
brew "mise"
brew "neovim"
brew "ninja"
brew "ripgrep"
brew "starship"
brew "stow"
brew "topgrade"
brew "wget"
brew "zoxide"
cask "alfred"
cask "firefox"
cask "ghostty"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
